In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
# Establish a connection between Python and the Sakila database
password = getpass()

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

<!-- Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved. -->

In [5]:
data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
data = pd.read_sql_query('SELECT month(rental_date) AS month , year(rental_date) AS year FROM rental', engine)
data.head()

   month  year
0      5  2005
1      5  2005
2      5  2005
3      5  2005
4      5  2005

In [7]:

def rentals_month(month, year, eng):

    query= f'SELECT * FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}'
    print(query)
    data = pd.read_sql_query(query, eng)
    engine.dispose()
    return data


month_data1=pd.DataFrame(rentals_month(5, 2005, engine))
month_data2=pd.DataFrame(rentals_month(6,2005,engine))

SELECT * FROM rental WHERE MONTH(rental_date) = 5 AND YEAR(rental_date) = 2005
SELECT * FROM rental WHERE MONTH(rental_date) = 6 AND YEAR(rental_date) = 2005

In [8]:
# Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

# The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

# Hint: Consider making use of pandas groupby()

import pandas as pd

def rentals_count_month(month,year,month_data):
    # Group the data by 'customer_id' and count rentals for each customer
    rental_counts = month_data.groupby('customer_id')['rental_id'].count().reset_index()
    rental_counts = rental_counts.rename(columns={'rental_id': 'rentals_'+ str(month) + '_' + str(year)})
    # result = pd.concat([rental_counts], ignore_index=False)
    
    return rental_counts

# Example usage:
result_1 = rentals_count_month(5, 2005,month_data1)
result_2 = rentals_count_month(6,2005,month_data2)

In [9]:
result_1

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [10]:
result_2.dtypes

customer_id       int64
rentals_6_2005    int64
dtype: object

In [11]:
import pandas as pd

def compare_rentals(result_1, result_2):
    # Extract the last column from result_1 and the second-to-last column from result_2
    column_name_1 = result_1.columns[-1]
    column_name_2 = result_2.columns[-1]

    # Calculate the difference and create a new DataFrame
    difference = result_1[column_name_1] - result_2[column_name_2]
    
    # Create a new DataFrame with the 'difference' column
    result = pd.concat([result_1, result_2, pd.DataFrame({'difference': difference})], axis=1)

    return result

answer=compare_rentals(result_1,result_2)
answer

     customer_id  rentals_5_2005  customer_id  rentals_6_2005  difference
0            1.0             2.0            1               7        -5.0
1            2.0             1.0            2               1         0.0
2            3.0             2.0            3               4        -2.0
3            5.0             3.0            4               6        -3.0
4            6.0             3.0            5               5        -2.0
..           ...             ...          ...             ...         ...
585          NaN             NaN          595               2         NaN
586          NaN             NaN          596               2         NaN
587          NaN             NaN          597               3         NaN
588          NaN             NaN          598               1         NaN
589          NaN             NaN          599               4         NaN

[590 rows x 5 columns]